Revit 2026 API

# LineLightShape Properties

---

The LineLightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmitLength | The emit length. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape) |

#### Reference

LineLightShape Class

Autodesk.Revit.DB.Lighting Namespace